{
    "sdmxtools": {
        "resources": [
            {
                "description": "The SDMX Global Registry is the official repository for SDMX Global DSDs, shared DSDs and cross-domain artefacts",
                "supported_features" : "The SDMX Global Registry Content Policy published on sdmx.org sets out the policy for artefacts stored, maintained and disseminated from the SDMX Global Registry",
                "url": "https://registry.sdmx.org/",
                "image": "https://raw.githubusercontent.com/SDMX-Outreach/sdmx-tools-catalogue/main/images/tools/sdmx-global-registry.png"
            },            
           {
                "description": "The SDMX Test Compability Kit (SDMX TCK) is a tool for measuring the compliance and coverage of an SDMX RESTful endpoint against the available SDMX REST API versions",
                "supported_features" : "<p>The objective of the SDMX TCK is to query an SDMX RESTful endpoint and provide a report with:</p><ul><li>The level of compliance, ie if the SDMX RESTful API is respected, by testing:<ul><li>All SDMX specified resources,</li><li>SDMX standard mime types,</li><li>The SDMX error codes,</li><li>Other features specified by the SDMX standard.</li></ul></li><li>The coverage: what percentage of resources and features are supported in terms of the specified responses.</li></ul>",
                "url": "https://www.sdmx.io/tools/sdmx-tck/",
                "image": "https://www.sdmx.io/images/tools/sdmx-tck/TCK_Logo_RGB.svg"
            },
            {
                "description": "sdmx.io is not a single project but an ecosystem of open source tools, patterns, guidance, learning materials and other resources like pre-configured containerised environments that make the software quick and simple to deploy. Sdmx.io, a valuable resource for tool developers as well as adopters.",
                "supported_features" : "sdmx.io covers the four main use cases in the statistics lifecycle:<ul><li>Data domain modelling</li><li>Data collection</li><li>Statistics production</li><li>Statistics dissemination</li></ul>",
                "url": "https://wwww.sdmx.io",
                "image": "https://www.sdmx.io/images/icons/Kraken_Main.svg"
            }
            
        ],
        "tools": [
            {
                "name": "pysdmx",
                "description": "pysdmx is a pragmatic and opinionated library written in Python. It focuses on simplicity, providing a subset of SDMX functionalities without requiring advanced knowledge of SDMX",
                "supported_features" : "<ul><li>Simplified subset of the SDMX information model in Python</li><li>Retrieve metadata from an SDMX registry to drive statistical processes</li><li>Data discovery and data retieval</li></ul>",
                "owner": "BIS",
                "license": "Apache",
                "url": "https://www.sdmx.io/tools/pysdmx/",
                "image": "https://www.sdmx.io/images/tools/linkage-x/pysdmx_logo_final_RGB.svg"
            },
            {
                "name": "Fusion Metadata Registry (FMR)",
                "description": "Fusion Metadata Registry (FMR) is a free to use SDMX structural metadata registry, data modelling platform and data processing engine for official statistics producers, collectors and reporters",
                "supported_features" : "<ul><li>A controlled repository for SDMX structural metadata, which acts as a single source of truth for: automated metadata-driven data processing systems, metadata needed by data providers in data collections, structures for the purposes of standardisation, statistical data harmonisation, and communal benefit</li><li>Three integrated metadata-driven data processing services: data validation, data transformation (mapping data between structures) and conversion of data between SDMX data formats.</li><li>Metadata authoring and maintenance web UI, enabling metadata managers to browse, author and maintain their structural metadata model.</li></ul>",
                "owner": "BIS",
                "license": "Apache",
                "url": "https://www.sdmx.io/tools/fmr/",
                "image": "https://www.sdmx.io/tools/fmr/FMR-Logo_FINAL_Icon.svg"
            },       
            {
                "name": "FMR Workbench",
                "description": "The FMR Workbench is a remote registry browser and metadata maintenance tool which brings the strengths and capabilities of the FMR User Interface to any SDMX compliant registry, implementing an SDMX RESTful API",
                "supported_features" : "The FMR Workbench is a remote registry browser and metadata maintenance tool which brings the strengths and capabilities of the FMR User Interface to any SDMX compliant registry, implementing an SDMX RESTful API. One significant use case for FMR Workbench users is the ability to connect to .Stat-Suite spaces for browsing and maintaining .Stat-Suite structural metadata",
                "owner": "BIS",
                "license": "Apache",
                "url": "https://www.sdmx.io/tools/fwb/",
                "image": "https://www.sdmx.io/images/tools/fwb-logo.jpg"
            },      
            {
                "name": "Fusion Transformer",
                "description": "Fusion Transformer is a Java command line application that can be run on both Windows and Unix for transforming SDMX data and structure files supporting EDI, XML, JSON and CSV",
                "supported_features" : "<ul><li>SDMX structure messages: SDMX 2.0, 2.1, 3.0, XML and JSON</li><li>SDMX data messages: SDMX 2.1, 3.0, EDI, XML, JSON, CSV</li></ul>",
                "owner": "BIS",
                "license": "Apache",
                "url": "https://www.sdmx.io/resources/download/ft/",
                "image": "https://www.sdmx.io/images/products/card-ft.png"
            },                              
            {
                "name": "SDMX Dashboard Generator",
                "description": "The SDMX Dashboard Generator (SDMX DG), co-winner of the SDMX Global Conference 2023 Hackathon, is an open source application that generates dynamic dashboards.",
                "supported_features" : "<ul><li>Most common visualization types such as key performance indicators (KPIs), lines, pie and bar charts</li><li>Dynamic integration of metadata available in multiple languages</li><li>Modularity and customizability of the dashboard layout and design set easily by the user via a specification file</li><li>Asynchronous retrieval of data and metadata from SDMX Rest API to ensure better performance</li><li>Running both on a local machine or on a server</li></ul>",
                "owner": "BIS",
                "license": "Apache",
                "url": "https://www.sdmx.io/tools/sdmx-dg/",
                "image": "https://www.sdmx.io/images/tools/sdmx-dg/Logo_RGB_colored.svg"
            },
            {
                "name": "Gingado",
                "description": "gingado is a machine learning library focused on economics and finance use cases. This package aims to be suitable for beginners and advanced users alike. Use cases may range from programmatic data retrievals using SDMX to experimentation with machine learning-based econometric estimators to more complex forecasting pipelines used in production.",
                "supported_features" : "<ul><li>Data augmentation, to add more data from official sources using SDMX, improving the machine models being trained by the user</li><li>Relevant datasets, both real and simulated, to allow for easier model development and comparison</li><li>Automatic benchmark model, to assess candidate models against a reasonably well-performant model</li><li>Machine learning-based estimators, to help answer questions of academic or practical importance</li><li>Support for model documentation, to embed documentation and ethical considerations in the model development phase</li><li>Utilities, including tools to allow for lagging variables in a straightforward way</li></ul>",
                "owner": "BIS",
                "license": "Apache",
                "url": "https://www.sdmx.io/tools/gingado/",
                "image": "https://www.sdmx.io/images/tools/linkage-x/logo-gingado.svg"
            },
            {
                "name": ".Stat Suite",
                "description": "The .Stat Suite is a standard-based, componentised, open-source platform for the efficient production and dissemination of high-quality statistical data. The product is based on the General Statistical Process Model (GSBPM) and the Statistical Data and Metadata eXchange standards.",
                "supported_features" : "<ul><li>Componentised architecture enabling a cooperative business model integrating open source tools to manage the complete data lifecycle.</li><li>A fully automated \"DevSecOps\" operation providing a flexible choice of deployment approaches (containerisation, docker, Kubernetes) and hosting options (on-premise, cloud, hybrid)</li></ul>",
                "owner": "SIS-CC (OECD)",
                "license": "MIT",
                "url": "https://sis-cc.gitlab.io/dotstatsuite-documentation/about/product-overview/",
                "image": "https://sis-cc.gitlab.io/.stat-suite/design/demo/logos-svg/images/statsuite-base.svg"
            },
            {
                "name": ".Stat Data Explorer",
                "description": "The .Stat Suite Data Explorer, a web-based application to easily find, access, and share data through a well-tuned navigation. Powered by the open-source platform .Stat Suite for the dissemination of Official Statistics.",
                "supported_features" : "<ul><li>React JS, D3, NodeJS</li><li>Solr search engine</li><li>SDMX Connectors: ArcGIS and PowerBI</li></ul>",
                "owner": "SIS-CC (OECD)",
                "license": "MIT",
                "url": "https://sis-cc.gitlab.io/dotstatsuite-documentation/about/product-overview/#stat-data-explorer-de",
                "image": "https://sis-cc.gitlab.io/.stat-suite/design/demo/logos-svg/images/dotstat-de-base.svg"
            },
             {
                "name": ".Stat Data Lifecycle Manager",
                "description": "The .Stat Data Lifecycle Manager, a set of adaptive back-office modules to efficiently and timely produce and (re-)use high quality statistical data by defining, running, automating, controlling and evaluating the underlying data processes.",
                "supported_features" : "<ul><li>React JS, NodeJS</li><li>Excel Add-in (SDMXSource)</li><li>FMR Workbench integration</li><li>SDMX  Libraries: R, Python, STATA</li></ul>",
                "owner": "SIS-CC (OECD)",
                "license": "MIT",
                "url": "https://sis-cc.gitlab.io/dotstatsuite-documentation/about/product-overview/#stat-data-lifecycle-manager-dlm",
                "image": "https://sis-cc.gitlab.io/.stat-suite/design/demo/logos-svg/images/dotstat-dlm-base.svg"
            },
            {
                "name": ".Stat Core",
                "description": "Fast and secure SDMX Data Store leveraging Eurostat’s (NSI Web Service implementation within its SDMX Reference Infrastructure.",
                "supported_features": "Stores and retrieves statistical data & attribute values, localizable structural & referential metadata, data process information & user roles and permissions. Allows customising the authentication method with any identity provider based on the OpenID Connect standard. Implements a secure configuration approach. Allows managing separate physical versions of data as it goes through the statistical production life cycle (raw input data, processed data, data prepared for dissemination/reporting, disseminated/reported data, archived data, …) by using multiple instances of the Data Store facilitated with a specific data transfer service.<ul><li>.NET Core</li><li>MSSQL Server, Maria DB</li><li>SDMX 2.0, 2.1 JSON, CSV, XML</li><li>Partial support for SDMX 3.0 (ongoing)</li></ul>",
                "owner": "SIS-CC (OECD)",
                "license": "MIT",
                "url": "https://sis-cc.gitlab.io/dotstatsuite-documentation/about/product-overview/#stat-core",
                "image": "https://sis-cc.gitlab.io/.stat-suite/design/demo/logos-svg/images/dotstat-core-base.svg"
            },
            {
                "name": ".Stat DLM Excel Add-in",
                "description": ".Stat DLM Excel Add-in is an Excel facilitator for data and referential metadata retrieval and editing. Directly within Excel it gives access to in-progress or published data, from internal or external SDMX data sources.",
                "supported_features": "The DLM Excel Add-in is packaged as a ClickOnce application and is deployed using the common procedure for deployment of ClickOnce applications. The installation files are accessible from here along with more information about deployment, set up and configuration.",
                "owner": "SIS-CC (OECD)",
                "license": "MIT",
                "url": "https://sis-cc.gitlab.io/dotstatsuite-documentation/using-dlm-excel-addin/",
                "image": "https://sis-cc.gitlab.io/dotstatsuite-documentation/images/dlm-excel-add-in_logo.png"
            },
            {
                "name": "SDMX Matrix Generator",
                "description": "The SIS-CC SDMX Matrix Generator can be used to visually model and design SDMX data artefacts, and generate the SDMX-ML markup for implementation. It is an enhancement of the Generic SDMX Design Matrix which has proven to be successful as a collaborative design tool for non-SDMX experts.",
                "supported_features": "The primary goal of the tool is to be able to create the artefacts without a lot of SDMX technical knowledge, and to put the focus on the statistical aspects of the data model.",
                "owner": "SIS-CC (OECD)",
                "license": "MIT",
                "url": "https://gitlab.com/sis-cc/sdmx-tools/sdmx-matrix-generator",
                "image": "https://gitlab.com/uploads/-/system/project/avatar/22866015/SDMX_matrix_generator_logo.png"
            },
            {
                "name": "SDMX Power BI connector",
                "description": "The SDMX Power BI connector makes it really simple for Power-BI report builders to quickly get data from an SDMX web service without having to bother about technical things like HTTP headers and parsing labels from codes. It can connect to any SDMX REST web service that supports the standard SDMX REST HTTP headers and can output SDMX-CSV (such as the NSI web service that is implemented by .Stat and many other platforms).",
                "supported_features": "The SDMX Power BI Connector was officially certifed by Microsoft in March 2023.",
                "owner": "SIS-CC (OECD)",
                "license": "MIT",
                "url": "https://gitlab.com/sis-cc/sdmx-tools/sdmx-power-bi",
                "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTQq6JJ5Y4aCQG2UYQMLDOTdlqzK_XTp11rXg&usqp=CAU"
            },
           {
                "name": "SDMX Converter",
                "description": "The SDMX Converter makes it possible to transform the existing data file format into the one of the user's choosing and / or verify that the structure of the data file matches the information comprised in the Data Structure Definition (DSD)",
                "supported_features" : "The SDMX Converter is able to read and generate various formats. For a complete list please go to <a href=\"https://cros.ec.europa.eu/dashboard/sdmx-converter#Conversions%20supported%20by%20formats\">SDMX Converter supported formats</a>",
                "owner": "Eurostat",
                "license": "Free",
                "url": "https://cros.ec.europa.eu/dashboard/sdmx-converter",
                "image": "https://ec.europa.eu/eurostat/documents/7589804/17996432/EN_05_SDMX_CONVERTER.png/1d559d5f-9899-c917-eb1a-d896d67b5089?t=1701270523160"
            },
 {
                "name": "SDMX Source",
                "description": "SDMX Source is a powerful library and programming API allowing developers to work with SDMX data and structural metadata.",
                "supported_features" : "SDMX Source is available in Java and .NET",
                "owner": "Eurostat",
                "license": "Free",
                "url": "https://cros.ec.europa.eu/dashboard/sdmx-source",
                "image": "https://ec.europa.eu/eurostat/documents/7589804/17996432/EN_01_SDMX_SOURCE.png/fb5ff84e-d528-4e1a-5e06-40338825d6b2?t=1701270531013"
            },
 {
                "name": "SDMX Reference Infrastructure",
                "description": "SDMX-RI is a set of pick-and-choose building blocks and tools that allow data to be exposed to the external world through access rights by using web services",
                "supported_features" : "SDMX-RI enables the production and dissemination of SDMX data from existing reference/dissemination databases. It is composed of reusable building blocks that are designed to provide data and structural metadata based on mappings to each organisation's dissemination data warehouse. SDMX-RI was developed in Java and .NET",
                "owner": "Eurostat",
                "license": "Free",
                "url": "https://cros.ec.europa.eu/dashboard/sdmx-ri",
                "image": "https://ec.europa.eu/eurostat/documents/7589804/17996432/EN_06_SDMX_Reference_Infrastructure.png/20993f76-7dcb-d4de-7d52-a4749db97aa9?t=1701270523100"
            },
            {
                "name": "SDMX Constructor",
                "description": "The SDMX Constructor is a very simple, powerful standalone tool designed to facilitate the modelling of aggregate data in accordance with SDMX standards. It is able to create and customize SDMX structural artifacts thereby enhancing the availability and accessibility of data through SDMX-compliant portals, such as the .Stat Suite.",
                "supported_features": "<ul><li>Creation and editing of essential SDMX structural metadata artifacts (such as DSD, Codelist, and Dataflow) aligned with predefined data models.</li><li>Integration at the structural data modeling phase, serving as a backend interface for seamless interoperability with the .Stat DLM via its SDMX API entry-point. </li><li>Capability to retrieve existing artifacts from any SDMX web service for review and modification, as well as effortless uploading of newly designed or modified artifacts through the API. </li></ul>",
                "owner": "Department of Statistics, International Labour Organization (ILO)",
                "license": "Free",
                "url": "https://ilostat.github.io/dsdc/index.html",
                "image": "https://webapps.ilo.org/ilostat/tools/dsdConstructor/images/dsdc_logo.png"
            },
            {
                "name": "Statistical Metadata-driven Analysis & Reporting Tool (SMART)",
                "description": "The SMART is a statistical processor and transcoding tool able to produce datasets by processing microdata or aggregate data in several formats, according to the structural metadata read from a Dataflow or DSD. The output files can be generated in diverse formats, intended for analysis, data reporting or to feed a dissemination platform.",
                "supported_features": "<ul><li> Configure SDMX dataset output based on DSD or dataflow;</li><li>read microdata or aggregated data from various formats, including SPSS, Stata, CSV, Excel, SDMX-ML, or SDMX-CSV;</li><li>retrieve existing data from any SDMX web service for review, mapping, and conversion;</li><li>utilize graphical tools for data visualization and command-line utilities for batch processing;</li><li>implement reusable mapping files and establish reproducible workflows;</li><li>upload the generated SDMX datasets directly via the SDMX API entry-point.</li></ul>",
                "owner": "Department of Statistics, International Labour Organization (ILO)",
                "license": "Free",
                "url": "https://ilostat.github.io/smart/index.html",
                "image": "https://webapps.ilo.org/ilostat/tools/smart/images/smart_logo.png"
            },
            {
                "name": "LMIS Excel Add-in",
                "description": "The LMIS Excel Add-in is a specialized software designed to facilitate data exchange with the .Stat Suite Data Lifecycle Manager (DLM), particularly for LMIS (Labour Market Information System) implementations with Excel. Its primary functionality includes the ability to download and upload data efficiently to and from the DLM end to Excel.",
                "supported_features": "<ul><li> handle data transactions with any standard SDMX registries to download and upload data to Excel;</li><li>With graphic interface to specify the SDMX web service entry point;</li><li>upload selected dataset in Worksheet directly via the SDMX API entry-point.</li></ul>",
                "owner": "Department of Statistics, International Labour Organization (ILO)",
                "license": "Free",
                "url": "https://webapps.ilo.org/ilostat/tools/SdmxExcelAddin/Install.htm",
                "image": "https://raw.githubusercontent.com/SDMX-Outreach/sdmx-tools-catalogue/main/images/tools/sdmx_tools_default.svg"
            },
            {
                "name": "SDMX in EViews",
                "description": "SDMX in EViews is a web-application to download SDMX data into EViews. The app is built upon EViews ability to read HTML tables and works by translating HTML requests into SDMX requests and SDMX data into HTML table that can be easily downloaded by EViews.",
                "supported_features" : "<ul><li>The app supports SDMX 2.1 requests for any providers. In addition, the app provides access to the lists of datasets, dimensions and codelists for Insee, ECB, Eurostat and Worldbank data.</li><li>How to use the web-application along with examples is described on the homepage of the web-application: http://sdmx.herokuapp.com. To ease the use of the app, an Eviews subroutine can also be downloaded at  http://sdmx.herokuapp.com/sub.html.</li></ul>",
                "owner": "Banque de France (Macroeconomic Analysis and Forecasting Directorate)",
                "license": "AGPL-3.0 license",
                "url": "http://sdmx.herokuapp.com",
                "image": "https://raw.githubusercontent.com/SDMX-Outreach/sdmx-tools-catalogue/main/images/tools/eviews.png"
            },
            {
                "name": "QuantHub SDMX SaaS Platform",
                "description": "QuantHub is a Cloud platform, designed specifically to address the three pillars of digital transformation focused on democratizing access to internal and external data sources, data analysis and data dissemination across the enterprise and public space.  QuantHub is targeted to produce and manage macro and micro economic data products using SDMX 3.0 data model.",
                "supported_features": "Data Ingestion Pipelines ; Data Modeling using SDMX 3.0 ; Data Transformation using Python ; Data Dissemination using SDMX API, Portal tools, Download; Integrations with Excel, Jupyter, PowerBI; Data and System Artifact’s Entitlement.",
                "owner": "EPAM Systems",
                "license": "Commercial License",
                "url": "https://quanthub.cloud",
                "image": "https://raw.githubusercontent.com/SDMX-Outreach/sdmx-tools-catalogue/main/images/tools/sdmx_tools_default.svg"
            },
            {
                "name": "RSDMX",
                "description": "rsdmx is a package to parse/read SDMX data and metadata in R.",
                "supported_features" : "It provides <ul><li>a set of classes and methods to read data and metadata documents exchanged through the Statistical Data and Metadata Exchange (SDMX) framework. The package currently focuses on the SDMX XML standard format (SDMX-ML)</li><li>an interface to SDMX web-services for a list of well-known data providers, such as EUROSTAT, OECD, and others.</li></ul>See also link to the tool",
                "owner": "Emmanuel Blondel",
                "license": "MIT",
                "url": "https://github.com/opensdmx/rsdmx/wiki",
                "image": "https://raw.githubusercontent.com/SDMX-Outreach/sdmx-tools-catalogue/main/images/tools/sdmx_tools_default.svg"
            }
            ,
            {
                "name": "SDMX Connectors",
                "description": "A set of plugins that can be used to browse the contents of SDMX providers, build queries and get data and metadata directly in the most popular data analysis tools (i.e. R, MATLAB, SAS, STATA, Excel).",
                "supported_features": "<ul><li>Download time series in R</li><li>Download datasets in R, MATLAB, STATA, SAS, Excel</li><li>Add new SDMX Providers on-the-fly</li><li>Add new SDMX Providers on-the-fly</li></ul>",
                "owner": "Bank of italy",
                "license": "European Union Public Licence",
                "url": "https://github.com/amattioc/SDMX",
                "image": "https://raw.githubusercontent.com/SDMX-Outreach/sdmx-tools-catalogue/main/images/tools/sdmx_tools_default.svg"
            }
        ]
    }
}
