{
    "sdmxtools": {
        "resources": [
           {
                "description": "The SDMX Test Compability Kit (SDMX TCK) is a tool for measuring the compliance and coverage of an SDMX RESTful endpoint against the available SDMX REST API versions.",
                "supported_features" : "This is an extended text to add more information about the resource.",
                "url": "https://www.sdmx.io/tools/sdmx-tck/",
                "image": "https://www.sdmx.io/images/tools/sdmx-tck/TCK_Logo_RGB.svg"
            },
            {
                "description": "sdmx.io is not a single project but an ecosystem of open source tools, patterns, guidance, learning materials and other resources like pre-configured containerised environments that make the software quick and simple to deploy. Sdmx.io, a valuable resource for tool developers as well as adopters.",
                "supported_features" : "This is an extended text to add more information about the resource.",
                "url": "https://wwww.sdmx.io",
                "image": "https://www.sdmx.io/images/icons/Kraken_Main.svg"
            }
            
        ],
        "tools": [
            {
                "name": "pysdmx",
                "description": "pysdmx is a pragmatic and opinionated library written in Python. It focuses on simplicity, providing a subset of SDMX functionalities without requiring advanced knowledge of SDMX",
                "supported_features" : "<ul><li>first bullet point</li><li>second bullet point</li><li>third bullet point</li></ul>",
                "owner": "BIS",
                "license": "Apache",
                "url": "https://www.sdmx.io/tools/pysdmx/",
                "image": "https://www.sdmx.io/images/tools/linkage-x/pysdmx_logo_final_RGB.svg"
            },
            {
                "name": "SDMX Dashboard Generator",
                "description": "The SDMX Dashboard Generator (SDMX DG), co-winner of the SDMX Global Conference 2023 Hackathon, is an open source application that generates dynamic dashboards.",
                "supported_features" : "This is an extended text to add more information about the tool, it could contain information about platforms etc.",
                "owner": "BIS",
                "license": "Apache",
                "url": "https://www.sdmx.io/tools/sdmx-dg/",
                "image": "https://www.sdmx.io/images/tools/sdmx-dg/Logo_RGB_colored.svg"
            },
            {
                "name": "Gingado",
                "description": "gingado is a machine learning library focused on economics and finance use cases. This package aims to be suitable for beginners and advanced users alike. Use cases may range from programmatic data retrievals using SDMX to experimentation with machine learning-based econometric estimators to more complex forecasting pipelines used in production.",
                "supported_features" : "This is an extended text to add more information about the tool, it could contain information about platforms etc.",
                "owner": "BIS",
                "license": "Apache",
                "url": "https://www.sdmx.io/tools/gingado/",
                "image": "https://www.sdmx.io/images/tools/linkage-x/logo-gingado.svg"
            },
            {
                "name": ".Stat Suite",
                "description": "The .Stat Suite is a standard-based, componentised, open-source platform for the efficient production and dissemination of high-quality statistical data. The product is based on the General Statistical Process Model (GSBPM) and the Statistical Data and Metadata eXchange standards.",
                "supported_features" : "This is an extended text to add more information about the tool, it could contain information about platforms etc.",
                "owner": "SIS-CC (OECD)",
                "license": "MIT",
                "url": "https://sis-cc.gitlab.io/dotstatsuite-documentation/about/product-overview/",
                "image": "https://sis-cc.gitlab.io/.stat-suite/design/demo/logos-svg/images/statsuite-base.svg"
            },
            {
                "name": ".Stat Data Explorer",
                "description": "The .Stat Suite Data Explorer, a web-based application to easily find, access, and share data through a well-tuned navigation. Powered by the open-source platform .Stat Suite for the dissemination of Official Statistics.",
                "supported_features" : "This is an extended text to add more information about the tool, it could contain information about platforms etc.",
                "owner": "SIS-CC (OECD)",
                "license": "MIT",
                "url": "https://sis-cc.gitlab.io/dotstatsuite-documentation/about/product-overview/#stat-data-explorer-de",
                "image": "https://sis-cc.gitlab.io/.stat-suite/design/demo/logos-svg/images/dotstat-de-base.svg"
            },
             {
                "name": ".Stat Data Lifecycle Manager",
                "description": "The .Stat Data Lifecycle Manager, a set of adaptive back-office modules to efficiently and timely produce and (re-)use high quality statistical data by defining, running, automating, controlling and evaluating the underlying data processes.",
                "supported_features" : "This is an extended text to add more information about the tool, it could contain information about platforms etc.",
                "owner": "SIS-CC (OECD)",
                "license": "MIT",
                "url": "https://sis-cc.gitlab.io/dotstatsuite-documentation/about/product-overview/#stat-data-lifecycle-manager-dlm",
                "image": "https://sis-cc.gitlab.io/.stat-suite/design/demo/logos-svg/images/dotstat-dlm-base.svg"
            },
            {
                "name": ".Stat Core",
                "description": "Fast and secure SDMX Data Store leveraging Eurostat’s (NSI Web Service implementation within its SDMX Reference Infrastructure.",
                "supported_features": "Stores and retrieves statistical data & attribute values, localizable structural & referential metadata, data process information & user roles and permissions. Allows customising the authentication method with any identity provider based on the OpenID Connect standard. Implements a secure configuration approach. Allows managing separate physical versions of data as it goes through the statistical production life cycle (raw input data, processed data, data prepared for dissemination/reporting, disseminated/reported data, archived data, …) by using multiple instances of the Data Store facilitated with a specific data transfer service.",
                "owner": "SIS-CC (OECD)",
                "license": "MIT",
                "url": "https://sis-cc.gitlab.io/dotstatsuite-documentation/about/product-overview/#stat-core",
                "image": "https://sis-cc.gitlab.io/.stat-suite/design/demo/logos-svg/images/dotstat-core-base.svg"
            },
            {
                "name": ".Stat DLM Excel Add-in",
                "description": ".Stat DLM Excel Add-in is an Excel facilitator for data and referential metadata retrieval and editing. Directly within Excel it gives access to in-progress or published data, from internal or external SDMX data sources.",
                "supported_features": "The DLM Excel Add-in is packaged as a ClickOnce application and is deployed using the common procedure for deployment of ClickOnce applications. The installation files are accessible from here along with more information about deployment, set up and configuration.",
                "owner": "SIS-CC (OECD)",
                "license": "MIT",
                "url": "https://sis-cc.gitlab.io/dotstatsuite-documentation/using-dlm-excel-addin/",
                "image": "https://sis-cc.gitlab.io/dotstatsuite-documentation/images/dlm-excel-add-in_logo.png"
            },
            {
                "name": "SDMX Matrix Generator",
                "description": "The SIS-CC SDMX Matrix Generator can be used to visually model and design SDMX data artefacts, and generate the SDMX-ML markup for implementation. It is an enhancement of the Generic SDMX Design Matrix which has proven to be successful as a collaborative design tool for non-SDMX experts.",
                "supported_features": "The primary goal of the tool is to be able to create the artefacts without a lot of SDMX technical knowledge, and to put the focus on the statistical aspects of the data model.",
                "owner": "SIS-CC (OECD)",
                "license": "MIT",
                "url": "https://gitlab.com/sis-cc/sdmx-tools/sdmx-matrix-generator",
                "image": "https://gitlab.com/uploads/-/system/project/avatar/22866015/SDMX_matrix_generator_logo.png"
            },
            {
                "name": "SDMX Power BI connector",
                "description": "The SDMX Power BI connector makes it really simple for Power-BI report builders to quickly get data from an SDMX web service without having to bother about technical things like HTTP headers and parsing labels from codes. It can connect to any SDMX REST web service that supports the standard SDMX REST HTTP headers and can output SDMX-CSV (such as the NSI web service that is implemented by .Stat and many other platforms).",
                "supported_features": "The SDMX Power BI Connector was officially certifed by Microsoft in March 2023.",
                "owner": "SIS-CC (OECD)",
                "license": "MIT",
                "url": "https://gitlab.com/sis-cc/sdmx-tools/sdmx-power-bi",
                "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTQq6JJ5Y4aCQG2UYQMLDOTdlqzK_XTp11rXg&usqp=CAU"
            },
            {
                "name": "SDMX converter",
                "description": "The SDMX Converter is a tool that converts statistical datasets between different formats (SDMX-ML, GESMES, Excel, DSPL)",
                "supported_features" : "This is an extended text to add more information about the tool, it could contain information about platforms etc.",
                "owner": "Eurostat",
                "license": "Free",
                "url": "https://cros.ec.europa.eu/dashboard/sdmx-converter",
                "image": "https://ec.europa.eu/eurostat/o/adaptive-media/image/17995989/Thumbnail-128x128/EN_04_SDMX_Converter_API.png?t=1701270530811"
            },
            {
                "name": "SDMX in EViews",
                "description": "<ul>SDMX in EViews is a web-application to download SDMX data into EViews. The app is built upon EViews ability to read HTML tables and works by translating HTML requests into SDMX requests and SDMX data into HTML table that can be easily downloaded by EViews.</ul><ul>The app supports SDMX 2.1 requests for any providers. In addition, the app provides access to the lists of datasets, dimensions and codelists for Insee, ECB, Eurostat and Worldbank data.</ul>
<ul>How to use the web-application along with examples is described on the homepage of the web-application: http://sdmx.herokuapp.com. To ease the use of the app, an Eviews subroutine can also be downloaded at  http://sdmx.herokuapp.com/sub.html.</ul>",
                "supported_features" : "SDMX 2.1 requests",
                "owner": "Banque de France (Macroeconomic Analysis and Forecasting Directorate)",
                "license": "AGPL-3.0 license",
                "url": "http://sdmx.herokuapp.com",
                "image": ""
            }
        ]
    }
}
